upstream/OpenFOAM-v2606/tutorials/lagrangian/MPPICFoam/cyclone/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(

    (-0.55 -0.55 -1  )
    ( 0.55 -0.55 -1  )
    ( 0.55  0.55 -1  )
    (-0.55  0.55 -1  )

    (-0.55 -0.55  1.1)
    ( 0.55 -0.55  1.1)
    ( 0.55  0.55  1.1)
    (-0.55  0.55  1.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (33 33 63) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
